


------
1
5.227.2.41, 2022.02.22,  19:40:9,  0
../public_html/testing/t_1/formatirovanie.pn
В одну строку записать элементы и атрибуты определяющие содержание и представление 7-го сверху параграфа
См. рисунок>


------
1
5.227.2.41, 2022.02.22,  21:25:1,  0
../public_html/testing/t_1/formatirovanie.pn
В одну строку записать элементы и атрибуты определяющие содержание и представление 7-го сверху параграфа
См. рисунок>


------
1
85.26.235.118, 2022.02.23,  21:22:46,  0
../public_html/testing/t_1/formatirovanie.pn
В одну строку записать элементы и атрибуты определяющие содержание и представление 7-го сверху параграфа
См. рисунок>


------
1
85.249.18.20, 2022.03.22,  17:15:16,  0
../public_html/testing/t_1/formatirovanie.pn
В одну строку записать элементы и атрибуты определяющие содержание и представление 7-го сверху параграфа
