


------
1
85.140.2.174, 2022.09.09,  10:01:49,  117
../public_html/testing/t_1/list.png
Создать список, аналогичный представленному в фрагменте 1
См. рисунок
1

------
2
85.140.2.174, 2022.09.09,  10:01:59,  66
../public_html/testing/t_1/table_1.gif
В одну строку записать элементы и атрибуты определяющие содержание и представление 1-го сверху ряда таблицы
См. рисунок
2

------
3
85.140.2.174, 2022.09.09,  10:02:3,  81
../public_html/testing/t_1/table_1.gif
В одну строку записать элементы и атрибуты определяющие содержание и представление 6-го сверху ряда таблицы
См. рисунок
3

------
4
85.140.2.174, 2022.09.09,  10:02:7,  45
../public_html/testing/t_1/forma.png
Создать фрагмент страницы, содержащий работающие (отправляющие на http://198.211.123.137:7633/cgi-bin/form_action.py) данные  формы с номерами 3 и 6 
См. рисунок
4

------
5
85.140.2.174, 2022.09.09,  10:02:12,  111
../public_html/testing/t_1/shop.png
Создать фрагмент таблицы, содержащий работающие (отправляющие на http://198.211.123.137:7633/cgi-bin/form_action.py) данные из 3-го ряда таблицы 
См. рисунок
5

------
6
85.140.2.174, 2022.09.09,  10:02:18,  93
../public_html/testing/t_1/table_img.gif
В одну строку записать элементы и атрибуты определяющие содержание и представление 3-го сверху ряда таблицы. ! На переднем плане может отображаться текст.
См. рисунок
6

------
7
85.140.2.174, 2022.09.09,  10:02:24,  54
../public_html/testing/t_1/forma.png
Создать фрагмент страницы, содержащий работающие (отправляющие на http://198.211.123.137:7633/cgi-bin/form_action.py) данные  формы с номерами 4 и 6 
См. рисунок
7

------
8
85.140.2.174, 2022.09.09,  10:02:27,  30
../public_html/testing/t_1/forma.png
Создать фрагмент страницы, содержащий работающие (отправляющие на http://198.211.123.137:7633/cgi-bin/form_action.py) данные  формы с номерами 2 и 5 
См. рисунок
8

------
9
85.140.2.174, 2022.09.09,  10:02:32,  42
../public_html/testing/t_1/forma.png
Создать фрагмент страницы, содержащий работающие (отправляющие на http://198.211.123.137:7633/cgi-bin/form_action.py) данные  формы с номерами 3 и 5 
См. рисунок
9

------
10
85.140.2.174, 2022.09.09,  10:02:36,  114
../public_html/testing/t_1/shop.png
Создать фрагмент таблицы, содержащий работающие (отправляющие на http://198.211.123.137:7633/cgi-bin/form_action.py) данные из 4-го ряда таблицы 
См. рисунок


------
11
85.140.2.174, 2022.09.09,  10:03:2,  60
../public_html/testing/t_1/forma.png
Создать фрагмент страницы, содержащий работающие (отправляющие на http://198.211.123.137:7633/cgi-bin/form_action.py) данные  формы с номерами 5 и 6 
См. рисунок


------
1
85.140.2.174, 2022.09.09,  10:07:8,  117
../public_html/testing/t_1/list.png
Создать список, аналогичный представленному в фрагменте 1
См. рисунок


------
2
85.140.2.174, 2022.09.09,  10:07:13,  66
../public_html/testing/t_1/table_1.gif
В одну строку записать элементы и атрибуты определяющие содержание и представление 1-го сверху ряда таблицы
См. рисунок


------
3
85.140.2.174, 2022.09.09,  10:07:27,  81
../public_html/testing/t_1/table_1.gif
В одну строку записать элементы и атрибуты определяющие содержание и представление 6-го сверху ряда таблицы
См. рисунок


------
4
85.140.2.174, 2022.09.09,  10:07:29,  45
../public_html/testing/t_1/forma.png
Создать фрагмент страницы, содержащий работающие (отправляющие на удаленный сервер) данные  формы с номерами 3 и 6 
См. рисунок


------
5
85.140.2.174, 2022.09.09,  10:07:31,  111
../public_html/testing/t_1/shop.png
Создать фрагмент таблицы, содержащий работающие (отправляющие на удаленный сервер) данные из 3-го ряда таблицы 
См. рисунок


------
6
85.140.2.174, 2022.09.09,  10:07:41,  93
../public_html/testing/t_1/table_img.gif
В одну строку записать элементы и атрибуты определяющие содержание и представление 3-го сверху ряда таблицы. ! На переднем плане может отображаться текст.
См. рисунок


------
7
85.140.2.174, 2022.09.09,  10:07:43,  54
../public_html/testing/t_1/forma.png
Создать фрагмент страницы, содержащий работающие (отправляющие на удаленный сервер) данные  формы с номерами 4 и 6 
См. рисунок


------
8
85.140.2.174, 2022.09.09,  10:07:54,  30
../public_html/testing/t_1/forma.png
Создать фрагмент страницы, содержащий работающие (отправляющие на удаленный сервер) данные  формы с номерами 2 и 5 
См. рисунок


------
9
85.140.2.174, 2022.09.09,  10:07:56,  42
../public_html/testing/t_1/forma.png
Создать фрагмент страницы, содержащий работающие (отправляющие на удаленный сервер) данные  формы с номерами 3 и 5 
См. рисунок


------
10
85.140.2.174, 2022.09.09,  10:08:0,  114
../public_html/testing/t_1/shop.png
Создать фрагмент таблицы, содержащий работающие (отправляющие на удаленный сервер) данные из 4-го ряда таблицы 
См. рисунок


------
11
85.140.2.174, 2022.09.09,  10:08:3,  60
../public_html/testing/t_1/forma.png
Создать фрагмент страницы, содержащий работающие (отправляющие на удаленный сервер) данные  формы с номерами 5 и 6 
См. рисунок


------
1
85.140.2.174, 2022.09.09,  10:12:28,  117
../public_html/testing/t_1/list.png
Создать список, аналогичный представленному в фрагменте 1
