del list[2]
list.remove("abc")
urlparse — Parse URLs into components

Контекстно-свободная грамматика регулярне выражения
Тольк С не описывается контекстно-свободной грамматикой
РВ можно разобрать только фрагмент строки, XML документ - невозможно



Типы объектов делятся по происхождению на базовые и фундаметальные

И еще пользовательские
    можно собрать с нуля
    
    можно создать еще один на основе уже созданного ранее - над базисом стротся надстройка(муха тоже вертолет) тип -вертолет (муха - вертолет, но плюс к этому еще что-то) - это способ типизации в С++ (задать схему и по схеме создавать объект)
    
    если объект - производный от данного - нужно создать новую схему иот этой схемы создавать новый объект
    
    перечисленое - класс - оринтированное программирование
    
    есть прототипо - ориентированное программирование (схем нет, но есть объект)
    чсто протот -ор в природе нет
    в Pyth можно добавлять внутр переменные но функции и методы добавлять нельзя
    
    приблудный - список (свойства методы (методы одинаковы - если имена одинаковы (даже если даелаю разное) и воможно переменные) совпадают - значит он того же типа, что и мой 
    затем я объекты меняю местами !наследование не причем
    утиная типизация (файлоподобные объекты)
    

метод - это функция засунутая внутрь объекта, 
    имя функции является переменной 
        (после нее можно поставить скобки и она будет вызовом)
    или после точки можно поставить свойство
        (при попытке его считать или записать он вызывает какую либо функци)
        (отличить свойство от внутренней переменной объекта непросто)
        (у объекта кирпич объем - это свойство, длина, ширина и высота - внутренние переменные -- но это свойство только на чтение)
        
    объект - нечто, что характеризуется 4-мя наборами параметров
        внутренние переменные
        методы
        свойства
        события - синал от данного объекта другому объекту в результате чего другой объект вызывет свой свой метод (в управлении событиями языки опираются на операционную систему или  на прикладную библиотеку, специально для этого предназначенную, а она опирается на операционную систему)
    
    тип объект 

